kernel/mm/mm_series/boot_mem_allocator.org
#+TITLE: 启动内存分配器
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../../../org-manual.css" type="text/css"> 

在编译时去初始化所有核心的内核内存数据结构是不切实际的，因为这时对硬件有许多限制．为了设置像物理页面分配器这样最基本的数据结构，都需要给它分配内存，但是物理分配器怎样给它自己分配内存呢？

为了解决这个问题，一个特别的叫做启动内存分配器被用到．它基于一个最基本的分配器：First Fit分配器，它使用bitmap来代表内存而不是自由块的链表．如果bit是1代表页面被分配了，而如果是0代表没有被分配．为了满足小于一个页面的分配需求，分配器会记录最后一次分配的页帧号(Page Frame
Number)以及偏移，随后较小的分配就会被归并存到用一个页面．

读者或许会好奇为什么这个分配器不在系统运行时也使用．一个重要的理由就是，为了满足分配会进行线性查找，这种代价很高．
